In [2]:
!pip install sqlalchemy==1.3.9
!pip install ibm_db_sa

Requirement already satisfied: sqlalchemy==1.3.9 in /home/jupyterlab/conda/envs/python/lib/python3.6/site-packages (1.3.9)
Requirement already satisfied: ibm_db_sa in /home/jupyterlab/conda/envs/python/lib/python3.6/site-packages (0.3.3)
Requirement already satisfied: sqlalchemy>=0.7.3 in /home/jupyterlab/conda/envs/python/lib/python3.6/site-packages (from ibm_db_sa) (1.3.9)

In [31]:
%load_ext sql
%sql ibm_db_sa://myx68993:gteNiL83Wh07L4YO@fbd88901-ebdb-4a4f-a32e-9822b9fb237b.c1ogj3sd0tgtu0lqde00.databases.appdomain.cloud:32731/bludb?security=SSL

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

'Connected: myx68993@bludb'

In [11]:
#Problem 1: Find the total number of crimes recorded in the CRIME table.

%sql select count(*) as TOTAL_CRIME from CHICAGO_CRIME_DATA;

 * ibm_db_sa://myx68993:***@fbd88901-ebdb-4a4f-a32e-9822b9fb237b.c1ogj3sd0tgtu0lqde00.databases.appdomain.cloud:32731/bludb
Done.

[(533,)]

In [14]:
#Problem 2: List community areas with per capita income less than 11000.

%sql select community_area_name, PER_CAPITA_INCOME from CENSUS_DATA where PER_CAPITA_INCOME < 11000;

 * ibm_db_sa://myx68993:***@fbd88901-ebdb-4a4f-a32e-9822b9fb237b.c1ogj3sd0tgtu0lqde00.databases.appdomain.cloud:32731/bludb
Done.

[('West Garfield Park', 10934),
 ('South Lawndale', 10402),
 ('Fuller Park', 10432),
 ('Riverdale', 8201)]

In [68]:
#Problem 3: List all case numbers for crimes involving minors?

%sql select CASE_NUMBER as MINOR_CRIME_CASE_NO from CHICAGO_CRIME_DATA where description like upper('%minor%');

 * ibm_db_sa://myx68993:***@fbd88901-ebdb-4a4f-a32e-9822b9fb237b.c1ogj3sd0tgtu0lqde00.databases.appdomain.cloud:32731/bludb
Done.

[('HL266884',), ('HK238408',)]

In [69]:
#Problem 4: List all kidnapping crimes involving a child?(children are not considered minors 
#for the purposes of crime analysis)

%sql select * from CHICAGO_CRIME_DATA where PRIMARY_TYPE='KIDNAPPING' and DESCRIPTION LIKE '%CHILD%'

 * ibm_db_sa://myx68993:***@fbd88901-ebdb-4a4f-a32e-9822b9fb237b.c1ogj3sd0tgtu0lqde00.databases.appdomain.cloud:32731/bludb
Done.

[(5276766, 'HN144152', datetime.date(2007, 1, 26), '050XX W VAN BUREN ST', '1792', 'KIDNAPPING', 'CHILD ABDUCTION/STRANGER', 'STREET', 'FALSE', 'FALSE', 1533, 15, 29, 25, '20', 1143050, 1897546, 2007, Decimal('41.87490841'), Decimal('-87.75024931'), '(41.874908413, -87.750249307)')]

In [29]:
#Problem 5: What kind of crimes were recorded at schools?

%sql select PRIMARY_TYPE, DESCRIPTION, LOCATION_DESCRIPTION   from CHICAGO_CRIME_DATA \
where LOCATION_DESCRIPTION LIKE '%SCHOOL%'

 * ibm_db_sa://myx68993:***@fbd88901-ebdb-4a4f-a32e-9822b9fb237b.c1ogj3sd0tgtu0lqde00.databases.appdomain.cloud:32731/bludb
Done.

[('BATTERY', 'SIMPLE', 'SCHOOL, PUBLIC, GROUNDS'),
 ('BATTERY', 'PRO EMP HANDS NO/MIN INJURY', 'SCHOOL, PUBLIC, BUILDING'),
 ('BATTERY', 'SIMPLE', 'SCHOOL, PUBLIC, BUILDING'),
 ('BATTERY', 'SIMPLE', 'SCHOOL, PUBLIC, BUILDING'),
 ('BATTERY', 'SIMPLE', 'SCHOOL, PUBLIC, GROUNDS'),
 ('CRIMINAL DAMAGE', 'TO VEHICLE', 'SCHOOL, PUBLIC, GROUNDS'),
 ('NARCOTICS', 'POSS: HEROIN(WHITE)', 'SCHOOL, PUBLIC, GROUNDS'),
 ('NARCOTICS', 'MANU/DEL:CANNABIS 10GM OR LESS', 'SCHOOL, PUBLIC, BUILDING'),
 ('ASSAULT', 'PRO EMP HANDS NO/MIN INJURY', 'SCHOOL, PUBLIC, GROUNDS'),
 ('CRIMINAL TRESPA', 'TO LAND', 'SCHOOL, PUBLIC, GROUNDS'),
 ('PUBLIC PEACE VI', 'BOMB THREAT', 'SCHOOL, PRIVATE, BUILDING'),
 ('PUBLIC PEACE VI', 'BOMB THREAT', 'SCHOOL, PUBLIC, BUILDING')]

In [34]:
#Problem 6: List the average safety score for all types of schools.

%sql select TYPE_OF_SCHOOL, AVG(SAFETY_SCORE) as AVG_SAFETY_SCORE from CHICAGO_PUBLIC_SCHOOLS \
group by TYPE_OF_SCHOOL;

 * ibm_db_sa://myx68993:***@fbd88901-ebdb-4a4f-a32e-9822b9fb237b.c1ogj3sd0tgtu0lqde00.databases.appdomain.cloud:32731/bludb
Done.

[('ES', 49), ('HS', 49), ('MS', 48)]

In [38]:
#Problem 7: List 5 community areas with highest % of households below poverty line.

%sql select community_area_name,  PERCENT_HOUSEHOLDS_BELOW_POVERTY from CENSUS_DATA \
order by PERCENT_HOUSEHOLDS_BELOW_POVERTY DESC LIMIT 5;

 * ibm_db_sa://myx68993:***@fbd88901-ebdb-4a4f-a32e-9822b9fb237b.c1ogj3sd0tgtu0lqde00.databases.appdomain.cloud:32731/bludb
Done.

[('Riverdale', Decimal('56.5')),
 ('Fuller Park', Decimal('51.2')),
 ('Englewood', Decimal('46.6')),
 ('North Lawndale', Decimal('43.1')),
 ('East Garfield Park', Decimal('42.4'))]

In [70]:
#Problem 8: Which community area(number) is most crime prone?

%sql select community_area_number, count(*) as TOT_CRIME from CHICAGO_CRIME_DATA \
where community_area_number is not NULL group by community_area_number order by TOT_CRIME desc limit 1;

 * ibm_db_sa://myx68993:***@fbd88901-ebdb-4a4f-a32e-9822b9fb237b.c1ogj3sd0tgtu0lqde00.databases.appdomain.cloud:32731/bludb
Done.

[(25, 43)]

In [44]:
#Problem 9: Use a sub-query to find the name of the community area with highest hardship index.

%sql select community_area_name, hardship_index from CENSUS_DATA where \
hardship_index = (select MAX(hardship_index) from CENSUS_DATA);

 * ibm_db_sa://myx68993:***@fbd88901-ebdb-4a4f-a32e-9822b9fb237b.c1ogj3sd0tgtu0lqde00.databases.appdomain.cloud:32731/bludb
Done.

[('Riverdale', 98)]

In [73]:
#Problem 10: Use a sub-query to determine the Community Area Name with most number of crimes?

%sql select CD.community_area_name from CENSUS_DATA as CD where CD.community_area_number \
in (select community_area_number from CHICAGO_CRIME_DATA where community_area_number is not NULL \
    group by community_area_number order by count(*) desc limit 1);

 * ibm_db_sa://myx68993:***@fbd88901-ebdb-4a4f-a32e-9822b9fb237b.c1ogj3sd0tgtu0lqde00.databases.appdomain.cloud:32731/bludb
Done.

[('Austin',)]

In [72]:
%sql select community_area_number, count(*) as TOT_CRIME from CHICAGO_CRIME_DATA \
 group by community_area_number order by TOT_CRIME desc;

 * ibm_db_sa://myx68993:***@fbd88901-ebdb-4a4f-a32e-9822b9fb237b.c1ogj3sd0tgtu0lqde00.databases.appdomain.cloud:32731/bludb
Done.

[(25, 43),
 (None, 43),
 (23, 22),
 (68, 21),
 (28, 16),
 (29, 16),
 (8, 15),
 (71, 14),
 (24, 13),
 (66, 12),
 (67, 12),
 (6, 11),
 (49, 11),
 (69, 11),
 (26, 10),
 (58, 10),
 (61, 10),
 (22, 9),
 (31, 9),
 (43, 9),
 (46, 9),
 (16, 8),
 (19, 8),
 (27, 8),
 (30, 8),
 (38, 8),
 (42, 8),
 (44, 8),
 (70, 8),
 (2, 7),
 (32, 7),
 (63, 7),
 (1, 6),
 (21, 6),
 (53, 6),
 (7, 5),
 (14, 5),
 (15, 5),
 (35, 5),
 (48, 5),
 (3, 4),
 (5, 4),
 (39, 4),
 (45, 4),
 (51, 4),
 (62, 4),
 (72, 4),
 (76, 4),
 (4, 3),
 (10, 3),
 (17, 3),
 (20, 3),
 (50, 3),
 (65, 3),
 (73, 3),
 (11, 2),
 (18, 2),
 (37, 2),
 (41, 2),
 (52, 2),
 (54, 2),
 (56, 2),
 (59, 2),
 (64, 2),
 (77, 2),
 (12, 1),
 (33, 1),
 (47, 1),
 (55, 1),
 (60, 1),
 (75, 1)]